app/controllers/hotspots_controller.rb

  def index
    @hotspots = Hotspot.order('name ASC')
---
SELECT "hotspots".* FROM "hotspots" WHERE (name <> 'street') ORDER BY name ASC

  def show
    @hotspot = Hotspot.find(params[:id])
---
SELECT "hotspots".* FROM "hotspots" WHERE "hotspots"."id" = $1 LIMIT 1  [["id", "324"]]

  def edit
    @hotspot = Hotspot.find(params[:id])
---
SELECT "hotspots".* FROM "hotspots" WHERE "hotspots"."id" = $1 LIMIT 1  [["id", "324"]]

  def destroy
    hotspot = Hotspot.find(params[:id])
    hotspot.delete
---
SELECT "hotspots".* FROM "hotspots" WHERE "hotspots"."id" = $1 LIMIT 1  [["id", "1039"]]
DELETE FROM "hotspots" WHERE "hotspots"."id" = 1039

  def seed
    entries = 0
    data_response = HTTParty.get('https://nycopendata.socrata.com/api/views/ehc4-fktp/rows.json?accessType=DOWNLOAD')
    json = JSON.parse(data_response.body)
    records = json['data']
    records.each do |record|

      while entries < 900


      Hotspot.create(
        name: record[10],
        street: record[12],
        city: record[13],
        zip: record[14],
        phone: record[15],
        fee: record[16],
        url: record[17],
        latitude: record[9][1],
      longitude: record[9][2])
---
INSERT INTO "hotspots" ("city", "created_at", "fee", "latitude", "longitude", "name", "phone", "street", "updated_at", "url", "zip") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"