app/controllers/ratings_controller.rb

	def new
		@hotspot = Hotspot.find(params[:id])
---
SELECT "hotspots".* FROM "hotspots" WHERE "hotspots"."id" = $1 LIMIT 1  [["id", "324"]]

	def create
		p params
		@rating = Rating.new(params[:rating])
		@hotspot = Hotspot.find(params[:rating][:hotspot_id])
		if @rating.save
---
SELECT "hotspots".* FROM "hotspots" WHERE "hotspots"."id" = $1 LIMIT 1  [["id", "{:value=>nil}"]]
INSERT INTO "ratings" ("accessibility", "comments", "created_at", "hotspot_id", "noise_level", "power", "reliability", "speed", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"