app/views/hotspots/index.html.erb

				<br />
				<%= link_to "#{pluralize(hotspot.ratings.count, 'rating')}",hotspot %>  |
---
SELECT COUNT(*) FROM "ratings" WHERE "ratings"."hotspot_id" = 640